----------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/macbook/Desktop/18-19 Thesis/Data Processing/GAP/GAPStoreOps.l
> og
  log type:  text
 opened on:  17 Oct 2018, 15:10:19

. 
. version 15

. 
. use allGap_v3.dta, clear

. keep code base bonus total hire reports title reportsto fileName

. 
. gsort -fileName 

. 
. keep in 3/9
(34 observations deleted)

. 
. gen payGap = total - total[_n-1]
(1 missing value generated)

. 
. save GAPStoreOps.dta, replace
(note: file GAPStoreOps.dta not found)
file GAPStoreOps.dta saved

. 
. outsheet code base bonus total hire reports title reportsto fileName payGap usin
> g GAPStoreOps.csv, comma

. 
. exit

end of do-file


. do "/var/folders/sy/4d9t8khs1jn_xflrv2wvq20c0000gn/T//SD00297.000000"

. use allGap_v3.dta, clear

. keep code base bonus total hire reports title reportsto fileName

. 
end of do-file

. do "/var/folders/sy/4d9t8khs1jn_xflrv2wvq20c0000gn/T//SD00297.000000"

. keep in 22/31
(31 observations deleted)

. 
end of do-file

. do "/var/folders/sy/4d9t8khs1jn_xflrv2wvq20c0000gn/T//SD00297.000000"

. gen payGap = total - total[_n-1]
(1 missing value generated)

. 
. save GAPBuying.dta, replace
(note: file GAPBuying.dta not found)
file GAPBuying.dta saved

. 
. outsheet code base bonus total hire reports title reportsto fileName payGap usin
> g GAPBuying.csv, comma

. 
. exit

end of do-file


. do "/var/folders/sy/4d9t8khs1jn_xflrv2wvq20c0000gn/T//SD00297.000000"

. cd "/Users/macbook/Desktop/18-19 Thesis/Data Processing/GAP"
/Users/macbook/Desktop/18-19 Thesis/Data Processing/GAP

. 
. capture log close
