------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/macbook/Desktop/18-19 Thesis/Data Processing/1997/RealConversion/TopSt
> orePlan_Construct.log
  log type:  text
 opened on:  18 Feb 2019, 09:02:55

. 
. version 15

. 
. local pathName "/Users/macbook/Desktop/18-19 Thesis/fromBefore/theData/1997/"

. 
. local fileList "05 Top Store Plan_Construct" ///
>         

. drop _all

. 
. // for each data file, replace base, bonus, and total 
. foreach fileName in "`fileList'" {
  2.         display "CHECKING: fileName is `fileName'."     //DDD
  3.         import delimited using "`pathName'`fileName'.txt",  clear // names
  4.         
.         quietly describe *base *bonus *total, varlist
  5.         local varList = r(varlist)
  6.         
.         //local vars `r(varlist)'
.         
.         // replace $ in each variable that ends with base
.         foreach varName of varlist `varList'    {
  7.                 
.                 //di "varName is `varName'" //DDD
.                 
.                 // check if varName is of type string
.                 local vartype: type `varName'
  8.                 
.                 //di "I got here" //DDD
.                 
.                 if substr("`vartype'",1,3)=="str"       {
  9.                         gen `varName'Num = subinstr(`varName', "$", "", .)
 10.                         replace `varName'Num = subinstr(`varName'Num, ",", "", .)
 11.                         drop `varName'
 12.                         
.                         // replace string with real
.                         gen `varName' = real(`varName'Num)
 13.                         drop `varName'Num
 14.                 }
 15.         }
 16.         
.         //save `fileName'.dta, replace 
. }
CHECKING: fileName is 05 Top Store Plan_Construct.
(30 vars, 42 obs)
(9 missing values generated)
(33 real changes made)
(9 missing values generated)
(28 missing values generated)
(14 real changes made)
(28 missing values generated)
(37 missing values generated)
(5 real changes made)
(37 missing values generated)
(27 missing values generated)
(15 real changes made)
(27 missing values generated)
(14 missing values generated)
(22 real changes made)
(14 missing values generated)
(34 missing values generated)
(5 real changes made)
(34 missing values generated)
(38 missing values generated)
(2 real changes made)
(38 missing values generated)
(34 missing values generated)
(5 real changes made)
(34 missing values generated)
(9 missing values generated)
(33 real changes made)
(9 missing values generated)
(28 missing values generated)
(14 real changes made)
(28 missing values generated)
(37 missing values generated)
(5 real changes made)
(37 missing values generated)
(27 missing values generated)
(15 real changes made)
(27 missing values generated)

. 
. exit

end of do-file


. use "/Users/macbook/Desktop/18-19 Thesis/fromBefore/theData/1997/42A Store Manager.dta",
>  clear

. use "/Users/macbook/Desktop/18-19 Thesis/fromBefore/theData/1997/41 Area Manager.dta"

. do "/var/folders/sy/4d9t8khs1jn_xflrv2wvq20c0000gn/T//SD00792.000000"

. cd "/Users/macbook/Desktop/18-19 Thesis/Data Processing/1997/RealConversion"
/Users/macbook/Desktop/18-19 Thesis/Data Processing/1997/RealConversion

. 
. capture log close
